Revit 2016 API
TextElement.LineWidth Property
 Width of widest line of the text element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property has been deprecated starting with Revit 2016. Use new Width property instead.")]
public double LineWidth { get; }
Visual Basic
<ObsoleteAttribute("This property has been deprecated starting with Revit 2016. Use new Width property instead.")> _
Public ReadOnly Property LineWidth As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property has been deprecated starting with Revit 2016. Use new Width property instead.")]
public:
property double LineWidth {
	double get ();
}
Remarks
The value is in sheet units, meaning it is as when measured on a printed sheet.
This is a read-only property, for the width of the widest line is calculated depending on the text and its wrapping within the box.
See Also
TextElement Class
Autodesk.Revit.DB Namespace